//Создать новый проект, запушить его на удалённый репозиторий GitHub. Сделать
//        несколько коммитов в мастер ветке. Создать отдельную ветку, переключиться на неё и
//        сделать несколько коммитов. Смержить в мастер ветку.
 class First_Try {
    public static void main(String[] args) {
        System.out.println("ThirdCommBranch2");
    }
}
